Reports/ОтчетПоБольничнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетПоБольничнымЛистам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатУпр</Name>
					<Comment>в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаДнейЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЧасовЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеУпр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремениДляСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремениДляСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаВидРасчета</Name>
					<Comment>если не заполнен, значи это не замена</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаКоличествоСтавок</Name>
					<Comment>если не заполнен, значи это не замена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаменыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыИОдноразовыеВыплатыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаписейРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Это либо Сотрудник, либо Внутренний совместитель, либо Сотрудник которого Заменяем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Reports/ОтчетПоБольничнымЛистам/Ext/ObjectModule.bsl
#Если Клиент Тогда

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетЗаСчетСоцстраха",				ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛ);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетЗаСчетОрганизации",				ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛОрганизации);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетБольничныйТравмаНаПроизводстве",	ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛТравмаНаПроизводстве);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетБольничныйОтпускПоБиР",			ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛПоБеременностиИРодам);
	
	                 
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = "Отчет по больничным листам";
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	ТекстЗапроса = "
	| ВЫБРАТЬ 	
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|   Больничный.Показатель1										КАК Показатель1,	
	|	Больничный.Регистратор.ПричинаНетрудоспособности			КАК Причина,	
	|	Больничный.Сотрудник										КАК Сотрудник,		
	|	Больничный.Регистратор										КАК Регистратор,		
	|	СУММА(Больничный.НормаДней)					 				КАК НормаДней,
	|	СУММА(Больничный.НормаЧасов)			 					КАК НормаЧасов,	
	|	СУММА(Больничный.Результат)						 			КАК Результат,
	|	СУММА(Больничный.НормаДнейОрг)					 			КАК НормаДнейОрг,
	|	СУММА(Больничный.НормаЧасовОрг)			 					КАК НормаЧасовОрг,	
	|	СУММА(Больничный.РезультатОрг)						 		КАК РезультатОрг,
	|	СУММА(Больничный.НормаДнейСоц)					 			КАК НормаДнейСоц,
	|	СУММА(Больничный.НормаЧасовСоц)			 					КАК НормаЧасовСоц,	
	|	СУММА(Больничный.РезультатСоц)					 			КАК РезультатСоц
	|
	|{ВЫБРАТЬ 
	|	РаботникиОрганизацииСрезПоследних.Организация.* 	КАК Организация	
	| }
	|ИЗ 
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(КонецПериода(&ДатаНач,Месяц),{Организация=&Организация}) КАК РаботникиОрганизацииСрезПоследних
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|   	ВЫБРАТЬ
	|   		БольничныйЗаСчетОрганизации.Показатель1 							КАК Показатель1,	
	|			БольничныйЗаСчетОрганизации.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйЗаСчетОрганизации.Сотрудник								КАК Сотрудник,			
	|			БольничныйЗаСчетОрганизации.Организация								КАК Организация,		
	|			БольничныйЗаСчетОрганизации.Регистратор								КАК Регистратор,		
	|			БольничныйЗаСчетОрганизации.НормаДней								КАК НормаДней,
	|			БольничныйЗаСчетОрганизации.НормаЧасов			 					КАК НормаЧасов,	
	|			БольничныйЗаСчетОрганизации.Результат								КАК Результат,
	|			БольничныйЗаСчетОрганизации.НормаДней								КАК НормаДнейОрг,
	|			БольничныйЗаСчетОрганизации.НормаЧасов			 					КАК НормаЧасовОрг,	
	|			БольничныйЗаСчетОрганизации.Результат								КАК РезультатОрг,
	|			0					КАК НормаДнейСоц,
	|			0			 		КАК НормаЧасовСоц,	
	|			0					КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйЗаСчетОрганизации
	|
	|   	ГДЕ	БольничныйЗаСчетОрганизации.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетОрганизации.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетОрганизации.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетОрганизации.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетОрганизации.ВидРасчета = &РасчетЗаСчетОрганизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|   	ВЫБРАТЬ
	|   		БольничныйЗаСчетСоцстраха.Показатель1 КАК Показатель1,	
	|			БольничныйЗаСчетСоцстраха.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйЗаСчетСоцстраха.Сотрудник							КАК Сотрудник,			
	|			БольничныйЗаСчетСоцстраха.Организация						КАК Организация,		
	|			БольничныйЗаСчетСоцстраха.Регистратор						КАК Регистратор,		
	|			БольничныйЗаСчетСоцстраха.НормаДней				КАК НормаДней,
	|			БольничныйЗаСчетСоцстраха.НормаЧасов			 	КАК НормаЧасов,	
	|			БольничныйЗаСчетСоцстраха.Результат				КАК Результат,
	|			0				КАК НормаДнейОрг,
	|			0			 	КАК НормаЧасовОрг,	
	|			0				КАК РезультатОрг,
	|			БольничныйЗаСчетСоцстраха.НормаДней					КАК НормаДнейСоц,
	|			БольничныйЗаСчетСоцстраха.НормаЧасов			 	КАК НормаЧасовСоц,	
	|			БольничныйЗаСчетСоцстраха.Результат					КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйЗаСчетСоцстраха
	|
	|   	ГДЕ	БольничныйЗаСчетСоцстраха.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетСоцстраха.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетСоцстраха.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетСоцстраха.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетСоцстраха.ВидРасчета = &РасчетЗаСчетСоцстраха
	// Больничный "Травма на производстве"
	|		ОБЪЕДИНИТЬ ВСЕ
	|   	ВЫБРАТЬ
	|   		БольничныйТравмаНаПроизводстве.Показатель1 КАК Показатель1,	
	|			БольничныйТравмаНаПроизводстве.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйТравмаНаПроизводстве.Сотрудник						КАК Сотрудник,		
	|			БольничныйТравмаНаПроизводстве.Организация						КАК Организация,		
	|			БольничныйТравмаНаПроизводстве.Регистратор						КАК Регистратор,		
	|			БольничныйТравмаНаПроизводстве.НормаДней				КАК НормаДней,
	|			БольничныйТравмаНаПроизводстве.НормаЧасов			 	КАК НормаЧасов,	
	|			БольничныйТравмаНаПроизводстве.Результат				КАК Результат,
	|			0				КАК НормаДнейОрг,
	|			0			 	КАК НормаЧасовОрг,	
	|			0				КАК РезультатОрг,
	|			БольничныйТравмаНаПроизводстве.НормаДней					КАК НормаДнейСоц,
	|			БольничныйТравмаНаПроизводстве.НормаЧасов			 	КАК НормаЧасовСоц,	
	|			БольничныйТравмаНаПроизводстве.Результат					КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйТравмаНаПроизводстве
	|
	|   	ГДЕ	БольничныйТравмаНаПроизводстве.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйТравмаНаПроизводстве.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйТравмаНаПроизводстве.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйТравмаНаПроизводстве.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйТравмаНаПроизводстве.ВидРасчета = &РасчетБольничныйТравмаНаПроизводстве
	// Больничный "Отпуск по БиР"
	|		ОБЪЕДИНИТЬ ВСЕ
	|   	ВЫБРАТЬ
	|   		БольничныйОтпускПоБиР.Показатель1 КАК Показатель1,	
	|			БольничныйОтпускПоБиР.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйОтпускПоБиР.Сотрудник							КАК Сотрудник,			
	|			БольничныйОтпускПоБиР.Организация						КАК Организация,		
	|			БольничныйОтпускПоБиР.Регистратор						КАК Регистратор,		
	|			БольничныйОтпускПоБиР.НормаДней				КАК НормаДней,
	|			БольничныйОтпускПоБиР.НормаЧасов			 	КАК НормаЧасов,	
	|			БольничныйОтпускПоБиР.Результат				КАК Результат,
	|			0				КАК НормаДнейОрг,
	|			0			 	КАК НормаЧасовОрг,	
	|			0				КАК РезультатОрг,
	|			БольничныйОтпускПоБиР.НормаДней					КАК НормаДнейСоц,
	|			БольничныйОтпускПоБиР.НормаЧасов			 	КАК НормаЧасовСоц,	
	|			БольничныйОтпускПоБиР.Результат					КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйОтпускПоБиР
	|
	|   	ГДЕ	БольничныйОтпускПоБиР.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйОтпускПоБиР.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйОтпускПоБиР.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйОтпускПоБиР.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйОтпускПоБиР.ВидРасчета = &РасчетБольничныйОтпускПоБиР
	//
	|
	|   ) КАК Больничный
	|	ПО	Больничный.Сотрудник = РаботникиОрганизацииСрезПоследних.Сотрудник 
	|   И	(Больничный.Организация = РаботникиОрганизацииСрезПоследних.Организация 
	|   ИЛИ	Больничный.Организация = РаботникиОрганизацииСрезПоследних.Организация.ГоловнаяОрганизация)//условие ИЛИ нужно будет убрать, если при проведении будет указана не головная организация а просто организация
	|
	|{ГДЕ
	|	РаботникиОрганизацииСрезПоследних.Организация.* 				КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.*	КАК ПодразделениеОрганизации,		
	|   Больничный.Показатель1 											КАК Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности.*				КАК Причина,		
	|	Больничный.Сотрудник.* 											КАК Сотрудник,                        	
	| 	Больничный.Регистратор.*										КАК Регистратор
	|}
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации,
	|	Больничный.Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности,
	|	Больничный.Сотрудник,
	|	Больничный.Регистратор	
	|
	|{УПОРЯДОЧИТЬ ПО
	|	РаботникиОрганизацииСрезПоследних.Организация.* КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.*	КАК ПодразделениеОрганизации,
	|   Больничный.Показатель1 КАК Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности.*					КАК Причина,
	|	Больничный.Сотрудник.*					КАК Сотрудник,	
	|	Больничный.Регистратор.*				КАК Регистратор	
	|}
	|
	|ИТОГИ 
	|	СУММА(НормаДней),
	|	СУММА(НормаЧасов),			
	|	СУММА(Результат),
	|	СУММА(НормаДнейОрг),
	|	СУММА(НормаЧасовОрг),			
	|	СУММА(РезультатОрг),
	|	СУММА(НормаДнейСоц),
	|	СУММА(НормаЧасовСоц),			
	|	СУММА(РезультатСоц)	
	|ПО ОБЩИЕ,	
	|	ПодразделениеОрганизации,
	|	Показатель1,
	|   Причина,
	|	Сотрудник,	
	|	Регистратор
	| 
	|
	|{ИТОГИ ПО	
	|	РаботникиОрганизацииСрезПоследних.Организация.* 				КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.*	КАК ПодразделениеОрганизации,
	|   Больничный.Показатель1 											КАК Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности.* 				КАК Причина,
	|   Больничный.Сотрудник.*											КАК Сотрудник,                	
	|	Больничный.Регистратор.*										КАК Регистратор	
	|}
	|";
	
							  
	
	ПостроительОтчета.Текст = ТекстЗапроса;							  
							  
	СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", "Подразделение");
	СтруктураПредставлениеПолей.Вставить("Сотрудник", "Работник");
	СтруктураПредставлениеПолей.Вставить("Показатель1", "Процент выплаты");
	СтруктураПредставлениеПолей.Вставить("Причина", "Причина болезни");	
	
	Если ОбщийОтчет.Показатели.Найти("НормаДней", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаДней", "Дней болезни", истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("НормаЧасов", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаЧасов", "Часов болезни", Истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("Результат", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("Результат", "Сумма", истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;			
	Если ОбщийОтчет.Показатели.Найти("НормаДнейОрг", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаДнейОрг", "Дни за счет предприятия", истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("НормаЧасовОрг", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаЧасовОрг", "Часы за счет предприятия", Истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("РезультатОрг", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("РезультатОрг", "Сумма за счет предприятия", истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;		
	Если ОбщийОтчет.Показатели.Найти("НормаДнейСоц", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаДнейСоц", "Дни за счет соцстраха", истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("НормаЧасовСоц", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаЧасовСоц", "Часы за счет соцстраха", Истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("РезультатСоц", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("РезультатСоц", "Сумма за счет соцстраха", истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;		
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	// группировки по умолчанию
	//ПостроительОтчета.ИзмеренияСтроки.Добавить("Организация");
	//ПостроительОтчета.ИзмеренияСтроки.Добавить("ПодразделениеОрганизации");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	
	// настройки отчета
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	//ОбщийОтчет.мРежимВводаПериода = 1; // Дата
	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший порцедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

#КонецЕсли
